const insertDoctors = `
INSERT INTO doctors 
(id, specialtyId, organizationId, regionId, firstName, middleName, lastName, email, phone, experience) VALUES
(0, 1, 0, 0, 'Max', 'William', 'Scott',  'email@email.com', 79999999, 1),
(1, 0, 2, 1, 'Alex', '', 'Smith',  'email@email.com',  79999999, 12),
(2, 2, 2, 2, 'АрдаковИгорьГерасимович', '', '',  'email@email.com',  79999999, 30),
(3, 9, 3, 3, 'ДонченкоИванАндреевич', '', '',  'email@email.com',  79999999, 19),
(4, 4, 6, 3, 'КулагинаЮлияАнатольевна', '', '',  'email@email.com',  79999999, 4),
(5, 8, 9, 3, 'БирюковЕвгенийЕвгеньевич', '', '',  'email@email.com',  79999999, 7),
(6, 3, 4, 4, 'ВасильевВалерийВалентинович', '', '',  'email@email.com',  79999999, 3),
(7, 0, 10, 0, 'ДылдинАлексейВалерьевич', '', '',  '',  79999999, 11),
(8, 0, 2, 3, 'ДевинИгорьВладимирович', '', '',  'email@email.com',  79999999, 60),
(9, 4, 6, 0, 'УгаровВикторМихайлович', '', '',  'email@email.com',  79999999,56),
(10, 5, 1, 6, 'ДемчукАлексейПавлович', '', '',  'email@email.com',  79999999,40),
(11, 6, 5, 0, 'ЗюлькинГригорийАлександрович', '', '',  'email@email.com',  79999999,1),
(12, 8, 5, 6, 'ГришинаОльгаКонстантиновна', '', '',  '',  79999999,7),
(13, 7, 5, 6, 'КарсеваПолинаАлексеевна', '', '',  'email@email.com',  79999999,8),
(14, 9, 8, 0, 'Логинов СергейНиколаевич', '', '',  'email@email.com',  79999999,9),
(15, 0, 8, 5, 'ЖарковаАллаЮрьевна', '', '',  'email@email.com',  79999999,3),
(16, 0, 7, 4, 'ШепелевАлексейВладимирович', '', '',  '',  79999999,3),
(17, 1, 9, 0, 'АпоянДавидСасунович', '', '',  'email@email.com',  79999999,7),
(18, 5, 3, 6, 'ЛогиноваГалинаВасильевна', '', '',  'email@email.com',  79999999,8),
(19, 2, 7, 0, 'РомановаТатьянаСтаниславовна', '', '',  '',  79999999,4),
(20, 5, 7, 6, 'КовешниковаТатьянаМихайловна', '', '',  'email@email.com',  79999999,8),
(21, 5, 7, 0, 'ФурманОксанаЛеонидовна', '', '',  'email@email.com',  79999999,6),
(22, 6, 7, 5, 'ТокареваЕленаВладимировна', '', '',  'email@email.com',  79999999,11),
(23, 2, 1, 6, 'РыбасРоманВладиславович', '', '',  '',  79999999,13),
(24, 2, 0, 0, 'МироновМихаилАнатольевич', '', '',  'email@email.com',  79999999,18),
(25, 4, 0, 6, 'ГоринВячеславВикторович', '', '',  'email@email.com',  79999999,26),
(26, 7, 9, 0, 'СтрючковСтаниславВладимирович', '', '',  '',  79999999,75),
(27, 8, 0, 5, 'ГалкинАлексейВикторович', '', '',  'email@email.com',  79999999,40),
(28, 0, 3, 1, 'БеляевМихаилВикторович', '', '',  'email@email.com',  79999999,25),
(29, 9, 7, 0, 'ВладимироваОльгаВикторовна', '', '',  'email@email.com',  79999999,23),
(30, 2, 8, 6, 'ШутоваСветланаВитальевна', '', '',  'email@email.com',  79999999,29),
(31, 0, 9, 6, 'ТарасееваГалинаНиколаевна', '', '',  'email@email.com',  79999999,5),
(32, 0, 1, 5, 'ШалдыбинДмитрийИгоревич', '', '',  'email@email.com',  79999999,3),
(33, 3, 0, 0, 'ОганезовВалерийЛеванович', '', '',  'email@email.com',  79999999,1),
(34, 0, 4, 5, 'ОленниковаМедеяМихайловна', '', '',  'email@email.com',  79999999,1),
(35, 0, 6, 2, 'ОленниковМихаилКонстантинович', '', '',  'email@email.com',  79999999,1);`

const insertSubSpecialties = `
INSERT INTO subSpecialties 
(id, name, specialtyId) VALUES
(0, 'стоматолог-хирург', 0),
(1, 'акушер-гинеколог', 1),
(2, 'челюстно-лицевой хирург', 0),
(3, 'невролог', 3),
(4, 'бактериолог', 1),
(5, 'нейрохирург', 5),
(6, 'сердечно-сосудистый хирург', 2),
(7, 'оториноларинголог', 1),
(8, 'травматолог-ортопед', 1),
(9, 'торакальный хирург', 5);`

const insertSpecialties = `
INSERT INTO specialties 
(id, name) VALUES
(0, 'стоматолог'),
(1, 'терапевт'),
(2, 'кардиолог'),
(3, 'невролог'),
(4, 'офтальмолог'),
(5, 'хирург'),
(6, 'педиатр');`

const insertOrgs = `
INSERT INTO organizations 
(id, orgTypeId, name) VALUES
(0, 0, 'ММКЦ Коммунарка'),
(1, 1, 'Больница №83 ФНКЦ ФМБА России'),
(2, 2, 'Больница РЖД-Медицина имени Семашко на Шоссейной (ранее ЦКБ №6)'),
(3, 3, 'Клиника онкологии'),
(4, 0, 'ЦКБ «РЖД-Медицина» на Будайской'),
(5, 1, 'Больница №61 (сейчас УКБ 4 МГМУ)'),
(6, 2, 'Клиника психиатрии Корсакова'),
(7, 3, 'Центр Кардиоангиологии (НПЦИК Сверчков переулок)'),
(8, 0, 'Клиника акушерства и гинекологии им. Снегирева'),
(9, 1, 'Клиника кожных и венерических болезней им. Рахманова'),
(10, 2, 'Клиника травматологии и ортопедии');`

const insertOrgTypes = `
INSERT INTO organizationTypes 
(id, name) VALUES
(0, 'Больница'),
(1, 'Поликлиника'),
(2, 'Травмпункт'),
(3, 'Частная клиника');`

const insertRegions = `
INSERT INTO regions 
(id, name) VALUES
(0, 'Москва'),
(1, 'Санкт-Петербург'),
(2, 'Красноярский край'),
(3, 'Республика Дагестан'),
(4, 'Республика Саха'),
(5, 'Республика Коми'),
(6, 'Хабаровская область');`

const insertAll = [
    insertDoctors,
    insertSubSpecialties,
    insertSpecialties,
    insertOrgs,
    insertOrgTypes,
    insertRegions,
]

export { insertAll }
